{
    "version": "https://jsonfeed.org/version/1",
    "title": "/Home/AlaskanTF - Journal of a Pleb",
    "description": "",
    "home_page_url": "https://blog.alaskantf.com",
    "feed_url": "https://blog.alaskantf.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "AlaskanTF(ATF)"
    },
    "items": [
        {
            "id": "https://blog.alaskantf.com/why-i-choose-unemployment/",
            "url": "https://blog.alaskantf.com/why-i-choose-unemployment/",
            "title": "Why I choose full-time &quot;Unemployment&quot;",
            "summary": "Okay, it was supposed to be a short post, but I locked in and didn't notice I was typing so much. lol I've had it&hellip;",
            "content_html": "<p>Okay, it was supposed to be a short post, but I locked in and didn't notice I was typing so much. lol</p>\n<h3>\"Get a Real Job\" Nonsense</h3>\n<p>I've had it with these mfking people saying this mfking sentence: \"Go get a real job.\"</p>\n<p>When people and by people, I mean family and friends ask me \"What do you do?\" and I mention that I’m unemployed and prefer not to have a full time job, they often look at me like I'm batshit crazy. Well, sometimes I do think I AM crazy.</p>\n<h3>Background Story:</h3>\n<p>I was never the default citizen.</p>\n<p class=\"msg msg--success\">Study hard → get the paper → land a job → pay taxes → get married → buy a house → die.</p>\n<p>In school, I was probably the “meh” below-average student. Things were too structured and boring. My answers would be marked wrong even if the final answer was correct because I used a different way to solve it. Most of the times, I just got it totally wrong lel. Still, I passed just enough to move on, which was fine by me. Not gonna waste my energy on something I'm not interested in,</p>\n<p>After studies, like every generic citizen here, I served in the military. That went smoothly, nothing much to say. Then came university, where I majored in Economics. Again, just an average student. No \"magna cum anything laude.\" LOL.</p>\n<p><strong>So why Economics?</strong></p>\n<p>Two words: <strong>Stock.</strong> <strong>Market.</strong></p>\n<p>I always had an interest in the market since the Great Recession and the invention of Bitcoin in 2008–2009. (I was a computer geek, story for another post.)</p>\n<p>I started trading/investing in equities in 2016. It’s like a video game: don’t run out of credits, and try to beat the high score. I LOVE IT.</p>\n<h3>My Brief 9-to-5 Life and Epiphany</h3>\n<p>After graduation, I went on a little soul-searching trip (backpacked and made many questionable financial choices), then got a job.</p>\n<p>Every day, it was:</p>\n<ul>\n<li>\"Looking\" stressed about KPIs (which I didn’t take seriously, of course. I ain’t here to build your dream, I’m here to take your money and build mine.)</li>\n<li>Useless micromanagement from clueless higher-ups who know shit and think \"synergy\" is a personality trait.</li>\n<li>Wake up at 6:30am, work all day, then try to trade U.S. markets from 9:30pm to 4:00am.</li>\n</ul>\n<p>Remember people, life is too short to stress over nonsense because:</p>\n<p class=\"msg msg--highlight\">If it can be done, get it done. If it can’t be done, why stress?</p>\n<p>After some quick calculations, I realized I made about the same or more in the market compared to my day job (before taxes). And where I live, capital gains are <strong>non-taxable</strong>.</p>\n<p>The 9-to-5 wasn’t just soul-sucking it was killing my portfolio. Trading the U.S. market (9:30pm–4:00am) while waking up at 6:30am to prep for work?</p>\n<p><strong>My quality of life was:</strong></p>\n<ul>\n<li>Sleep: <strong>Fucked</strong></li>\n<li>Freedom: <strong>None</strong></li>\n<li>Returns: <strong>Minimal</strong></li>\n</ul>\n<p>So I stayed there for a year since the pay was decent for a fresh grad, but really, I was just there to leech their money and fuck off which I did gracefully, like a polite thief. I added the earnings to my portfolio, gave it a nice boost, and never looked back.</p>\n<p>Now, I am full-time unemployed, a job I love. Some days are chill, some are stressful AF. But:</p>\n<ul>\n<li>Rest when I want</li>\n<li>Work at my peak hours</li>\n<li>No one to bug me</li>\n<li>Travel freely as long as I’ve got my laptop and internet</li>\n<li>Watch a movie/game/chat with friends while monitoring markets on chill days</li>\n<li>You get it.</li>\n</ul>\n<p>BTW, the stressful days are AWESOME! It keeps me in check, on my feet and prevent complacency.</p>\n<h3>Salary VS My Unemployment</h3>\n<p>Let’s base the numbers on a $100K annual income. You can change the numbers and the outcome would be the same as they are in percentages.</p>\n<p><strong>Mr. 9-to-5 Salaryman</strong></p>\n<ul>\n<li>Annual Salary: +$100,000</li>\n<li>20% Sovereign Fund Contribution: -$20,000 (To be returned when? God knows, it keeps moving further away.)</li>\n<li>17% Employer Top-up to Sovereign Fund: +$17,000</li>\n<li>Income Tax: -$5,650</li>\n</ul>\n<p>Total Compensation: $100,000 + $17,000 = $117,000<br>Take-Home: $100,000 - $20,000 - $5,650 = $74,350<br>Locked in Sovereign Fund (aka Narnia): $37,000 (Growing at ~4% per annum)</p>\n<p><strong>Me – The Allegedly \"Unemployed\"</strong></p>\n<ul>\n<li>Annual Income: +$100,000</li>\n<li>Sovereign Fund Contribution: -$0</li>\n<li>Employer Top-up: +$0</li>\n<li>Income Tax: -$0</li>\n</ul>\n<p>Total Compensation: $100,000<br>Take-Home: $100,000<br>Locked in Sovereign Fund: $0</p>\n<p>Let's not forget about the power of compounding in the market.</p>\n<p>Mr Salaryman would be getting $117000 per year.</p>\n<p>The unemployedman would be getting ($100,000 + gain%) and then (total from previous year + gains%) repeated yearly.</p>\n<p>That's just a rough calculation.</p>\n<h3>But the Benefits! The Stability! The “Buy House!”</h3>\n<p>According to the default citizens, they make $17,000 more than me and have $37,000 in the sovereign fund earning ~4% per year.</p>\n<p>Here’s my POV: Yep, you made $17,000 more but your $37,000 is locked up until you either buy a house and empty it doing so, reach the ever shifting retirement age, or die and pass it to your kids.</p>\n<p>I take home $25,650 more than you and reinvest it into a portfolio that returned ~80% annually (versus your fund’s 4%).</p>\n<p>So being unemployed gives me more liquidity, no tax, and the freedom to top up my sovereign fund <strong>if</strong> I ever feel like buying a house. (CPF should never be reason for buying a house, unless you agree that you require someone a.k.a government to babysit your spending habits.) Either way, it's probably impossible to buy a house here without getting cuffed or locked down for life. But stability, ah, the illusion of it. We’ll get into that a little later.</p>\n<h3>TL;DR – Why I'm Not Chained to a Desk</h3>\n<p>I’m not unemployed because <strong>I can’t get a job</strong>. (I haven’t checked. Maybe I can't. LOL.)</p>\n<p>I’m unemployed because <strong>I already have a job, </strong>one that:</p>\n<ul>\n<li>Pays well (in my opinion, really subjective)</li>\n<li>No uncomfortable office wear</li>\n<li>Unlimited breaks</li>\n<li>More time with family and friends</li>\n<li>Hobbies such as the <a href=\"https://blog.alaskantf.com/my-projects/\" target=\"_blank\" rel=\"noopener noreferrer\">projects</a> i'm working on</li>\n<li>Not taxed to oblivion (Income already taxed and our taxed income is than taxed again; GST, road tax, property tax etc. Cmon bruh.)</li>\n</ul>\n<p>So to everyone who keeps telling me to “get a real job”:</p>\n<p class=\"msg msg--success msg--highlight msg--warning\">I have one. It’s just not the kind you can flex on LinkedIn.</p>\n<h3>Final Thoughts</h3>\n<p>I’d agree stability is an issue. But I’ve never seen stability stop death from coming.</p>\n<p>We plan, save, insure, and settle and then one day, we vanish. I’d rather live with uncertainty than die having played it safe.</p>\n<p>Risk keeps me awake. The unknown keeps me on my feet. Security might help you live longer, but curiosity is what makes you feel alive now.</p>\n<p>I’ve always believed in the present. The past is gone. The future might never come. So what else is there but now?</p>\n<h4>Random thoughts:</h4>\n<p>The government always says we have to work hard for the future generation, for the future of the country. But when exactly do we get to enjoy ourselves?</p>\n<p>We build the present and live the present. Let the future generation build and enjoy theirs.</p>\n<p>Because if every generation is only building for the next, here’s what happens: each generation ends up living off the previous ones and nothing truly progresses. It’s just sacrifice passed down like an heirloom, and nobody gets to celebrate. That's probably what all government wants, mindless people, under their control with the illusion of control.</p>\n<p>Thank you for reading.</p>",
            "image": "https://blog.alaskantf.com/media/posts/14/Screenshot_20250818_151032-2.png",
            "author": {
                "name": "AlaskanTF(ATF)"
            },
            "tags": [
                   "Reflections",
                   "In-my-opinion",
                   "Finance"
            ],
            "date_published": "2025-08-18T16:49:00+08:00",
            "date_modified": "2025-08-18T19:37:44+08:00"
        },
        {
            "id": "https://blog.alaskantf.com/hello-world/",
            "url": "https://blog.alaskantf.com/hello-world/",
            "title": "Hello, world!",
            "summary": "Just a test post.",
            "content_html": "<p>Just a test post.</p>",
            "author": {
                "name": "AlaskanTF(ATF)"
            },
            "tags": [
                   "Travel Journal",
                   "Tech Tools",
                   "Reflections",
                   "Privacy Journey",
                   "Guides/How-To",
                   "Gaming"
            ],
            "date_published": "2025-08-06T13:36:24+08:00",
            "date_modified": "2025-08-06T18:18:44+08:00"
        }
    ]
}
